Shubuo/SD.SPI.FATFS-Stm32F103/main.c
  }while(f_size>0);
 
  return FR_OK;
}

/* FRESULT open_append ----------------------------------------------------------*/

	FRESULT open_append (
    FIL* fp,            /* [OUT] File object to create */
    const char* path    /* [IN]  File name to be opened */
	)
	{
    FRESULT fr;
		FRESULT aux;

    /* Opens an existing file. If not exist, creates a new file. */
		
    fr = f_open(fp, path, FA_WRITE | FA_OPEN_ALWAYS);
    if (fr == FR_OK) {
        /* Seek to end of the file to append data */
        aux = f_lseek(fp, f_size(fp));
        if (aux != FR_OK)
            f_close(fp);
    }
    return fr;
}
	

void Update_RTC(void){
	
	HAL_RTC_GetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
	minutos = sTime.Minutes;	
	horas = sTime.Hours;
	dia = sDate.Date;
	mes = sDate.Month;
	ano =	sDate.Year;
}

void LCD_ShowRTC(void){
	
	sprintf(taux1,"%02d/%02d/%02d",dia,mes,ano);
	LCD_CURSOR(1,8);	
  ENVIA_STRING_LCD(taux1);
	LCD_CURSOR(0,11);	
	sprintf(taux,"%02d:%02d",hora,minutos);
	ENVIA_STRING_LCD(taux);
	LCD_CURSOR(1,20);

}

void SD_Backup(void){
	
	//  Inicializacao uSD	
			
	disk_initialize(SDFatFs.drv);
					
				if(SD_Init() != 0){
					
					LCD_LIMPA();
					ENVIA_STRING_LCD("NO SD");
					HAL_Delay(500);
				}
				else{					
					if(f_mount(&SDFatFs,(const char*)USER_Path,0)!= FR_OK){
								LCD_LIMPA();
								ENVIA_STRING_LCD("OPEN ERROR 1");
					}
					else{
								
						if(open_append(&MyFile,"MEDICAO.txt") != FR_OK){						
								LCD_LIMPA();
								ENVIA_STRING_LCD("OPEN ERROR 2");																
					}
							else{														
								Update_RTC();					
								f_printf(&MyFile, "Data: %02u/%02u/%u, %2u:%02u\n",dia,mes,ano,horas,minutos);
								f_printf(&MyFile, "FORCA: 123121.1231 \n");			
								f_close(&MyFile);
								
								
							
								LCD_LIMPA();
								ENVIA_STRING_LCD("Saved...");
								HAL_Delay(800); 
					}					 
				}
			}							
				FATFS_UnLinkDriver(USER_Path);
	}

unsigned long ReadCount(void){
	
	unsigned long Count;
	unsigned char i;
	
	HX_DT_HIGH(); //ADDO=1;
	HX_SCK_LOW(); //ADSK=0;
	
	Count=0;
  while(HX_DT_Read()); 				//while(ADDO); 
	
	for (i=0;i<24;i++){
		HX_SCK_HIGH(); 						//ADSK=1;
		Count=Count<<1;
		HX_SCK_LOW();							//ADSK=0;
		if(HX_DT_Read()) Count++;		//if(ADDO)
	}
	
	HX_SCK_HIGH();								//ADSK=1;
	Count=Count^0x800000;
	HX_SCK_LOW();								//ADSK=0;
	return(Count);
} 


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
	

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
	
	
	
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FATFS_Init();
  MX_RTC_Init();
  MX_SPI2_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
	
	LCD_INICIALIZA();
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		
		
		
		
		
switch(estado){
			
			case 0:
			{				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("MENU");
					teste = 1;	
				}
				
				Update_RTC();
				LCD_ShowRTC();
								
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));					
					estado = 1;
					teste = 0;
				}	       
			break; 
			}
			
			case 1:
			{			

				Update_RTC();
				LCD_ShowRTC();			
				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("TARA");
					teste = 1;
				}
				
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					LCD_LIMPA();
					ENVIA_STRING_LCD("OBTENDO TARA");
					HAL_Delay(1000);
					LCD_LIMPA();
					ENVIA_STRING_LCD("SUCESSO");
					HAL_Delay(1000);
					teste = 0;
				}
								
				if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
					while(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin));
					estado = 2;
					teste = 0;
				}
				if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
					while(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin));
					estado = 3;
					teste = 0;
				}       
			break; 
			}
			
			case 2:
			{		

				Update_RTC();
				LCD_ShowRTC();			
				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("INICIAR");
					LCD_CURSOR(1,20);
					teste = 1;
					
				}
				
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					LCD_LIMPA();
					

         //  Inicializacao uSD				
					
//				if(SD_Init() != 0){					
//					LCD_LIMPA();
//					ENVIA_STRING_LCD("NO SD");
//					HAL_Delay(500);		
//					teste=0;
//				}
//				else{					
//					SD_Backup();					
//				}			
					
					
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0){
					auxForce =	 ReadCount();
					sprintf(taux1,"Forca: %lu",auxForce);
					LCD_CURSOR(0,0);
					ENVIA_STRING_LCD(taux1);	
					HAL_Delay(200);
						teste =0;
					}						
				
				}
								
				if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
					while(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin));
					estado = 1;
					teste = 0;
				}       
				else if (HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
					while(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin));
					estado = 3;
					teste = 0;				
				}
			break; 
			}
			case 3:
			{				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("DATA/HORA");
					teste = 1;
				}
					
				Update_RTC();
				LCD_ShowRTC();				
				
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					LCD_LIMPA();
					ENVIA_STRING_LCD("SELECIONE:");
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
								
					do{			
						
									
