Shubuo/SD.SPI.FATFS-Stm32F103/main.c
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							horas += 1;							
							if(horas > 23){
								horas = 0;
							}
							sTime.Hours = horas;
							HAL_Delay(50);							
																												
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
							horas -= 1;							
							if(horas< 0){
								horas = 23;
							}
							sTime.Hours = horas;
							HAL_Delay(50);
						}						
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					HAL_RTC_SetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
					HAL_Delay(50);
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							minutos += 1;
								if(minutos > 59){
									minutos = 0;
								}							
								 
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
							minutos -= 1;
								if(minutos < 0){
									minutos = 59;
								}							
							HAL_Delay(50);
						}						
						
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					sTime.Minutes = minutos;
					HAL_RTC_SetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							dia += 1;
							if(dia > 31){
								dia = 1;
							}							
							sDate.Date = dia;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
								dia -= 1;
								if(dia < 1){
									dia = 31;
								}							
							sDate.Date = dia;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
						}							
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							mes += 1;
							if(mes > 12){
								mes = 0;
							}							
							sDate.Month = mes;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
								mes -= 1;
								if(mes < 0){
									mes = 12;
								}							
							sDate.Month = mes;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
						}	
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					// -------------------------------------------------------------------
					do{	
						hora = horas;
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",hora,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							ano += 1;
							if(ano > 99){
								ano = 0;
							}							
							sDate.Year = ano;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
								ano -= 1;
								if(ano < 0){
									ano = 99;
								}							
							sDate.Year = ano;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
						}	
												
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					teste =0;				
				}
					
			if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
				while(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin));
				estado = 2;
				teste = 0;
				
			}
			
			if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
				while(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin));
				estado = 1;
				teste = 0;
			}  			
				
			break; 				
					
			}								
				
			}	
		
			
			
  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

